htmlized-src/erlang/dic.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>dic.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">Dict,or Map&#30340;&#31616;&#21333;&#23454;&#29616;</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2011-11-10 &#22235;</span>
<span class="org-meta-line">#+DESCRIPTION:Dict,or Map&#30340;&#31616;&#21333;&#23454;&#29616;
#+KEYWORDS: erlang
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+FILETAGS: @Erlang
</span>
<span class="org-block-begin-line">#+begin_src erlang
</span><span class="org-block">-module(dic).
-export([put/3,new/0,delete/2,get/2]).

%% &#29992;List &#26500;&#24314;Map.

new () -&gt;
    [].

put(Key,Value,[]) -&gt;
    [{Key,Value}];
put(Key,Value,[{Key,_}|T])-&gt;
    [{Key,Value}|T];
put(Key,Value,[{Key1,V1}|T]) -&gt;
    [{Key1,V1}|put(Key,Value,T)].

delete(Key,[{Key,_}|T])-&gt;
    T;
delete(_,[]) -&gt;
    [];
delete(Key,[{Key1,V1}|T]) -&gt;
    [{Key1,V1}|delete(Key,T)].

get(Key,[{Key,Value}|_])-&gt;
    Value;
get(Key,[{_,_}|T]) -&gt;
    get(Key,T);
get(_,[]) -&gt;
    nil.
</span><span class="org-block-end-line">#+end_src
</span>&#19978;&#38754;&#30340;&#23454;&#29616;&#24403;&#25968;&#37327;&#24456;&#22823;&#26102;&#25928;&#29575;&#26377;&#38382;&#39064;.&#19979;&#38754;&#29992;&#38750;&#24179;&#34913;&#20108;&#21449;&#26641;&#26469;&#23454;&#29616;.
<span class="org-block-begin-line">#+begin_src erlang
</span><span class="org-block">  -module(dic).
  -export([put/3,get/2,del/2,new/0,test/0]).
  %% &#29992;&#38750;&#24179;&#34913;&#20108;&#21449;&#26641;, &#36825;&#31181;&#32467;&#26500;&#30340;&#35775;&#38382;&#26102;&#38388;&#19982;&#23427;&#25152;&#21253;&#21547;&#30340;&#39033;&#30340;&#25968;&#37327;&#25104;&#23545;&#25968;&#20851;&#31995;
  new()-&gt;
      nil.
  put(Key,Value,nil) -&gt;                           %&#21521;&#31354;&#26641;&#20013;&#25554;&#20540;
      [Key,Value,nil,nil];
  put(Key,Value,[Key,_,Smaller,Bigger]) -&gt;        %&#26367;&#25442;&#26641;&#20013;&#24050;&#26377;&#20540;
      [Key,Value,Smaller,Bigger];
  put(Key,Value,[Key1,V1,Smaller,Bigger]) when Key&lt; Key1 -&gt; % &#23545;&#20110;&#27604;&#24403;&#21069;&#33410;&#28857;&#23567;&#30340;&#20540;&#22914;&#20309;&#22788;&#29702;
      [Key1,V1,put(Key,Value,Smaller),Bigger];
  put(Key,Value,[Key1,V1,Smaller,Bigger]) when Key&gt; Key1 -&gt; %&#23545;&#20110;&#27604;&#24403;&#21069;&#33410;&#28857;&#22823;&#30340;&#20540;&#22914;&#20309;&#22788;&#29702;.
      [Key1,V1,Smaller,put(Key,Value,Bigger)].

  get(_,nil)-&gt;
      nil;
  get(Key,[Key,Value,_,_]) -&gt;
      Value;
  get(Key,[Key1,_,Smaller,_]) when Key&lt;Key1 -&gt;
      get(Key,Smaller);
  get(Key,[Key1,_,_,Bigger]) when Key&gt;Key1 -&gt;
      get(Key,Bigger).

  del(_ ,nil)-&gt;
      nil;
  del(Key,[Key,_,Smaller,nil]) -&gt;
      Smaller;
  del(Key,[Key,_,nil,Bigger]) -&gt;
      Bigger;
  del(Key,[Key1,Value1,Smaller,Bigger]) when Key &lt; Key1 -&gt;
      [Key1,Value1,del(Key,Smaller) ,Bigger];
  del(Key,[Key1,Value1,Smaller,Bigger]) when Key &gt; Key1 -&gt;
      [Key1,Value1,Smaller ,del(Key,Bigger)];

  del(Key,[Key1,_,Smaller,Bigger])  when Key==Key1-&gt;
      [Key2,Value2,Smaller2]=delp(Smaller),
      [Key2,Value2,Smaller2,Bigger].

  %% delp&#36820;&#22238;,&#19968;&#20010;&#20010;[&#26368;&#22823;key,&#26368;&#22823;value,&#23376;tree]
  %% delp(nil)-&gt;
  %%     [nil,nil,nil];
  delp([Key,Value,nil,nil])-&gt;
      [Key,Value,nil];
  delp([Key,Value,Smaller,nil])-&gt;
      [Key,Value,Smaller];
  delp([Key,Value,Smaller,Bigger]) -&gt;
      [Key2,Value2,Bigger2]=delp(Bigger),
      [Key2,Value2,[Key,Value,Smaller,Bigger2]].

  test()-&gt;
      V1=new(),
      V2=put(10,a,V1),
      V3=put(3,a,V2),
      V4=put(20,a,V3),
      V5=put(5,a,V4),
      V6=put(15,a,V5),
      V7=put(25,a,V6),
      V8=put(35,a,V7),
      V9=put(11,a,V8),
      V10=put(1,a,V9),
      V11=put(9,a,V10),
      V12=put(16,a,V11),
      V13=put(33,a,V12),
      V14=put(40,a,V13),
      V15=put(18,a,V14),
      V16=put(13,a,V15),
      V16.

</span><span class="org-block-end-line">#+end_src
</span></pre>
  </body>
</html>
